tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/autoupdate"


# -----------------------------------------------------------------------------
# MacOS App Store
# -----------------------------------------------------------------------------
brew "mas"


# -----------------------------------------------------------------------------
# CLI
# -----------------------------------------------------------------------------
brew "yadm"
brew "yt-dlp"


# -----------------------------------------------------------------------------
# Apps
# -----------------------------------------------------------------------------
cask "1password"
cask "alfred"
cask "appcleaner"
cask "alt-tab"
cask "bartender"
cask "calibre"
cask "double-commander"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "freetube"
cask "hiddenbar"
cask "karabiner-elements"
cask "knockknock"
cask "krisp"
cask "mkvtoolnix"
cask "privadovpn"
cask "rectangle"
cask "scummvm"
cask "signal"
cask "stats"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "transnomino"
cask "vlc"
cask "whatsapp"
mas "Keynote", id:409183694
mas "Pages", id:409201541
mas "Numbers", id:409203825
mas "Flow - Focus & Pomodoro Timer", id:1423210932


# -----------------------------------------------------------------------------
# Fonts & Plugins
# -----------------------------------------------------------------------------
cask "font-source-code-pro"
cask "font-open-sans"
cask "font-catamaran"
cask "font-montserrat"
